/*
 * फ़ाइल: कोनो लाइनबग। जावा
 * -----------------------
 * beeper एस की एक पंक्ति beeper लिए थोड़ी देर के लूप
 * का उपयोग करता है। यह कार्यक्रम किसी भी आकार की दु
 * निया के लिए काम करता है। हालांकि, क्योंकि प्रत्येक
 * दुनिया एक कम की आवश्यकता है move से रों putBeeper
 * रों यह हमेशा एक याद करते beeper ।
 */
import stanford.कैरेल.*;
public class Conoलाइनबग extends कैरेल {
   public void run() {
   	  /* जब तक करेल एक दीवार का सामना करता है तब तक दोहराता है */
      while(frontIsClear()) {
      	 /* वर्तमान वर्ग पर beeper */ 
         putBeeper();
      	 /* move अगले वर्ग के लिए */
         move();
      }
   }
}