/*
 * ملف: مخروطخطعلة
 * --------------
 * يستخدم while دورة لوضع خط مخروط s. هذا البرنامج يع
 * مل من أجل عالم من أي حجم. ومع ذلك ، لأن كل عالم يت
 * طلب move ثانية واحدة أقل من putBeeper ثانية ، فإنه
 * يفتقد دائمًا إلى مخروط .
 */
import stanford.كاريل.*;
public class مخروطخطعلة extends كاريل {
   public void run() {
   	  /* يكرر حتى كاريل يواجه الجدار */
      while(frontIsClear()) {
      	 /* ضع مخروط على الساحة الحالية */ 
         putBeeper();
      	 /* move إلى المربع التالي */
         move();
      }
   }
}