/*
 * ملف: ركنخمسةمخروطق
 * -----------------
 * يضع خمسة مخروط ثانية في كل زاوية
 */
import stanford.كاريل.*;
public class ركنخمسةمخروطق extends كاريل {

   public void run() {
      /* كرر مرة واحدة لكل ركن */
      for(int i = 0; i < 4; i++) {
         وضعخمسةمخروطثانية();
         moveإلىالزاويةالتالية();
      }
   } 

   /* إعادة كاريل إلى الزاوية التالية */
   public void moveإلىالزاويةالتالية() {
      move();
      move();
      move();
      turnLeft();
   }

   /* يضع 5 مخروط s باستخدام دورة for */
   public void وضعخمسةمخروطثانية() {
      for(int i = 0; i < 5; i++) {
      	putBeeper();
      }
   }
}