/*
 * קובץ: ביפראיסוףקארל
 * -------------------
 * המחלקה ביפראיסוףקארל אוספת את כל הביפרים בסדרה של
 * מגדלים אנכיים ומפקידה אותם בפינה המזרחית בשורה
 * הראשונה.
 */
import סטנפורד.קאראל.*;
public class ביפראיסוףקארל extends קארל {

   /**
    * מציין את נקודת הכניסה לתוכנית.
    */
   public void run() {
      לאסוףאתכלBeepers();
      כלBeepers();
      לחזורהביתה();
   }

   /**
    * אוספת את הביפרים מכל מגדל על ידי נע לאורך השורה
    * הראשונה, מתקשר אכמגדלאחד בכל פינה. התנאי לשיטה זו
    * הוא שקארל נמצא בפינה המזרחית של השורה הראשונה
    * שפונה מזרחה.
    */
   private void לאסוףאתכלBeepers() {
      while (imentברור()) {
         לאסוףמגדלאחד();
         מהלך_\_לזוז_\_לעבור(); 
      }
      לאסוףמגדלאחד();
   }

   /**
    * אוספת את הביפרים במגדל אחד. כאשר נקראגדגדלאחד
    * נקרא, קארל חייב להיות בשורה הראשונה הפונה מזרחה.
    * התנאי המוקדם עבורגדגדגד הוא כי קארל חייב להיות
    * שוב פונה מזרחה באותה פינה.
    */
   private void לאסוףמגדלאחד() {
      פונהשמאלה();
      לאסוףקושלצפצופים();
      תסתובב();
      עבוראלקיר();
      פונהשמאלה();
   }

   /**
    * אוספת שורה של צפצופים רצופים. קצה קו האיתור מסומן
    * בפינה שאינה מכילה ביפר.
    */
   private void לאסוףקושלצפצופים() {
      while (beepersהנוכחי()) {
         בחרביפר();
         if (imentברור()) {
            מהלך_\_לזוז_\_לעבור(); 
         }
      } 
   }

   /**
    * משליך את כל הביפרים על הפינה הנוכחית.
    */
   private void כלBeepers() {
      while (beepersבתיק()) {
         שיםאתביפר();
      }
   }

   /**
    * מחזירה את קארל למצבה הראשוני בפינת השדרה הראשונה
    * והשורה הראשונה, הפונה מזרחה. התנאי המוקדם לשיטה
    * זו הוא שקארל חייב לפנות מזרחה איפשהו בשורה
    * הראשונה, וזה נכון בסיום שלאתאתכל ביפרס.
    */
   private void לחזורהביתה() {
      תסתובב();
      עבוראלקיר();
      תסתובב();
   }

   /** מעביר את קארל קדימה עד שהוא נחסם על ידי קיר. */
   private void עבוראלקיר(){
      while (imentברור()) {
         מהלך_\_לזוז_\_לעבור();
      } 
   }

   /** הופך קארל 180 מעלות מסביב */
   private void תסתובב(){
      פונהשמאלה();
      פונהשמאלה();
   }
}