/*
 * קובץ: חמשפינות
 * --------------
 * במקום חמישה צפצופים בכל פינה
 */
import סטנפורד.קאראל.*;
public class חמשפינות extends קארל {

   public void run() {
      /* חזור פעם אחת לכל פינה */
      for(int i = 0; i < 4; i++) {
         לשיםחמישהצפצופים();
         מעברלפינההבאה();
      }
   } 

   /* למקם מחדש קאראל לפינה הבאה */
   public void מעברלפינההבאה() {
      מהלך_\_לזוז_\_לעבור();
      מהלך_\_לזוז_\_לעבור();
      מהלך_\_לזוז_\_לעבור();
      פונהשמאלה();
   }

   /* מקומות 5 צפצופים באמצעות לולאה */
   public void לשיםחמישהצפצופים() {
      for(int i = 0; i < 5; i++) {
      	שיםאתביפר();
      }
   }
}