/*
 * קובץ: ביפרקוטףאתקארל
 * --------------------
 * ביפרקוטפתאתקארל תוכנית מגדיר שיטת "run" עם שלוש
 * פקודות. פקודות אלה לגרום קארל להתקדם בלוק אחד,
 * להרים ביפר, ולאחר מכן להתקדם אל הפינה הבאה.
 */
import סטנפורד.קאראל.*;
public class ביפרטוטלקארל extends קארל {
   public void run() {
      מהלך_\_לזוז_\_לעבור();
      בחרביפר();
      מהלך_\_לזוז_\_לעבור();
      פונהשמאלה();
      מהלך_\_לזוז_\_לעבור();
      פנהימינה();
      מהלך_\_לזוז_\_לעבור();
      מהלך_\_לזוז_\_לעבור();
      שיםאתביפר();
      מהלך_\_לזוז_\_לעבור();
   }

   /**
    * הופך קארל 90 מעלות ימינה.
    */
   private void פנהימינה() {
      פונהשמאלה();
      פונהשמאלה();
      פונהשמאלה();
   }
}