/*
 * קובץ: ביפרקוטףאתקארל
 * --------------------
 * הביפרקוטפתאתקארל תוכנית מגדירה שיטת "ריצה" עם
 * פקודות שגורמות לקארל להרים ביפר ולמקם אותו על
 * מדף.
 */
import סטנפורד.קאראל.*;
public class ביפרקוטףאתקארל extends קארל {
   public void run() {
      מהלך_\_לזוז_\_לעבור();
      בחרביפר();
      מהלך_\_לזוז_\_לעבור();
      פונהשמאלה();
      מהלך_\_לזוז_\_לעבור();
      פונהשמאלה();
      פונהשמאלה();
      פונהשמאלה();
      מהלך_\_לזוז_\_לעבור();
      מהלך_\_לזוז_\_לעבור();
      שיםאתביפר();
      מהלך_\_לזוז_\_לעבור();
   } 
}